aaron-bond.better-comments
antfu.slidev
anthropic.claude-code
anysphere.cursorpyright
biomejs.biome
bradlc.vscode-tailwindcss
castrogusttavo.symbols
cjl.todo-tree-enhanced
cweijan.dbclient-jdbc
cweijan.vscode-database-client2
databricks.neon-local-connect
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
denoland.vscode-deno
eamodio.gitlens
editorconfig.editorconfig
enkia.tokyo-night
esbenp.prettier-vscode
expo.vscode-expo-tools
github.vscode-github-actions
github.vscode-pull-request-github
humao.rest-client
kisstkondoros.vscode-gutter-preview
mguellsegarra.highlight-on-copy
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
pflannery.vscode-versionlens
pkief.material-icon-theme
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-spanish
tamasfe.even-better-toml
usernamehw.errorlens
wesbos.theme-cobalt2
yoavbls.pretty-ts-errors
